Repository: Hassan-Morgan/power_mass_todo_app
Catalog: lib/core/l10n/app_*.arb
Languages: ar

# app_title
source: Tasks Todo
ar: مهام يجب القيام بها

# welcome_message
source: Welcome to Todo App
ar: مرحبا بك في تطبيق تودو

source: Ok
ar: تم

# successfull_title
source: Successfull
ar: تم بنجاح

# successfull_reset_email_message
source: reset password email sent successfully please check your mail
ar: ايميل اعادة تعيين الباسور ارسل بنجاح برجاء التحقق من بريدك الالكتروني

# wrong_email_title
source: Wrong Email
ar: ايميل غير صحيح

# wrong_email_message
source: the email you entered doesn't exist
ar: الايميل الذي قمت بأدخالة غير موجود

# network_failure_title
source: Network Failure
ar: خطأ في الاتصال

# auth_failure_title
source: Authentication Failure
ar: خطأ في المصادقة

# server_failure_title
source: Server Failure
ar: خطأ في الخادم

# network_failure_message
source: please check your internet connection and try again
ar: برجاء التأكد من اتصال الانترنت والمحاولة مرة اخري

# auth_failure_message_canceld_by_user
source: the operation have been canceled please try again
ar: لقد تم الغاء العملية برجاء المحاولة مرة اخري

# auth_failure_message_invalid_inputs
source: invalid email or password please check your inputs
ar: الايميل او كلمة السر غير صحيحة

# auth_failure_message_already_registered
source: this email is already registered if you can't sign in your account maybe you registerd with google
ar: هذا الايميل مستخدم من قبل برجاء تسجل الدخول

# server_failure_message
source: error happened while try to connect to the server please try again later
ar: حدث خطأ عند الاتصال بالخادم برجاء المحاولة في وقت اخر

source: Sign Up
ar: تسجيل حساب جديد

source: Sign In
ar: تسجيل الدخول

# sing_up_header_message
source: Sign up for free
ar: سجل الان مجانا

# sign_in_header_message
source: Sign in to your account
ar: سجل الدخول الي حسابك

source: Email
ar: الايميل

source: Password
ar: كلمة السر

# forgot_password
source: Forgot the password?
ar: نسيت كلمة السر؟

source: or continue with
ar: او سجل باستخدام

source: Google
ar: جوجل

# have_no_account_message
source: don't have account?
ar: لا امتلك حساب؟

# have_account_message
source: already_have_account?
ar: امتلك حساب بالفعل؟

# email_validation_message
source: ⛔️ Invalide Email
ar: ⛔️ الايميل غير صحيح

# empty_email_validation_message
source: ⛔️ Email is required
ar: ⛔️ ️يجب ادخال ايميل

# password_validation_message
source: ⛔️ Invalide Password
ar: ⛔️ كلمة السر غير صحيحة

# empty_password_validation_message
source: ⛔️ Password is required
ar: ⛔️ يجب ادخال كلمة السر

# password_values_to_validate
source: Password should contain at least 8 characters, one upper case, one lower case, one number and one special character ( . ! @ # $ & * ~ )
ar: كلمة السر يجب ان تكون بطول ٨ احرف علي الاقل و تحتوي علي حرف كبير بالانجليزية و حرف صغير بالانجليزية و رقم و احد الاحرف الخاصة ( . ! @ # $ & * ~ )

# send_reset_email
source: Send Email
ar: ارسال الايميل

# verify_email
source: Verify your Email
ar: تأكيد حسابك

# verify_email_header
source: verification email sent please check your mail to continue
ar: لقد تم ارسال ايميل الي بريدك الالكتروني برجاء تاكيد الحساب للمتابعة

# send_verification_email
source: resend verification email
ar: اعادة ارسال الايميل

# verify_email_server_error
source: server error happen too many requestes can cause this error please wait 5 min and try again
ar: خطأ في الخادم من الممكن ان يكون السبب في ذلك كثره الطلبات المرسلة برجاء الانتظار 5 دقائق والمحاولة مرة اخري

# already_verified
source: I have verified email
ar: لقد قمت بتأكيد الحساب

# successfull_verify_email_message
source: verification email sent successfully please check you mail
ar: ايميل تأكيد حسابك ارسل بنجاح برجاء مراجعة بريدك الالكتروني

# complete_profile_title
source: Complete your info
ar: أكمل بياناتك

source: user name
ar: اسم المستخدم

source: phone number
ar: رقم الهاتف

source: done
ar: انهاء

# error_title
source: Error happened
ar: لقد حدث خطأ

# upload_image_error_message
source: Error happened while try to upload image please try again
ar: حدث خطأ اثناء محاولة رفع الصورة لرجاء المحاولة مرة اخري

# firestore_error
source: server error happened please try again
ar: خطأ عند محاولة تخزين البيانات برجاء المحاولة مره اخري

# no_image_picked
source: you didn't pick any image please try again
ar: لم تقم باختيار صوره برجاء المحاولة مره اخري

# this_field_required
source: this field is required
ar: يجب ادخال هذا الحقل

# change_profile_image
source: change image
ar: تغيير الصورة

# succeffull_operation
source: operation done succeffully
ar: تمت العملية بنجاح

source: Active Tasks
ar: المهام النشطة

source: Past Tasks
ar: المهام الماضية

source: No Active Tasks
ar: لا يوجد مهام نشطة حاليا

# no_tasks
source: No Tasks Stored In the data base
ar: لا يوجد مهام مخزنة في قاعدة البيانات

# add_new_task
source: add task
ar: أضف مهمة

source: task title
ar: عنوان المهمة

source: task description
ar: وصف المهمة

source: task start time
ar: وقت بدأ المهمة

source: task end time
ar: وقت انهاء المهمة

# task_employees
source: task employess
ar: الموظفون

source: No time picked
ar: لم يتم اختيار وقت

# unvalid_time
source: the start time should be less than the end time
ar: وقت البداية يجب ان يكون اقل من وقت الانتهاء

# start_date
source: Start:
ar: يبدأ:

# end_date
source: End:
ar: ينتهي:

source: Employees:
ar: الموظفون:

source: Manager:
ar: المدير:

# finish
source: Finish Task
ar: أنهاء المهمة

source: Task Details
ar: تفاصيل المهمة

# add_task_error
source: can't add task please try again later
ar: خطأ اثناء اضافه المهمة برجاء المحاولة مره اخري

# end_task_error
source: can't end task please try again later
ar: خطأ اثناء انهاء المهمة برجاء المحاولة مره اخري
